Revit 2026 API

# SpotDimensionSpotDimensionType Property

---

The dimension style of this dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpotDimensionType SpotDimensionType { get; set; }
```
```vb
Public Property SpotDimensionType As SpotDimensionType
	Get
	Set
```
```cpp
public:
property SpotDimensionType^ SpotDimensionType {
	SpotDimensionType^ get ();
	void set (SpotDimensionType^ value);
}
```
```fsharp
member SpotDimensionType : SpotDimensionType with get, set
```

#### Property Value

SpotDimensionType

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace